Repository: Mobile-app-promotions-and-discounts/IOSApp
Catalog: DiscountsAndPromotionsApp/Configuration/ErrorHandler.xcstrings
Source language: en
Languages: ru

# authError
source: Invalid email or password
ru: Неверный email или пароль

# barcodeScanError
source: Failed to read barcode
ru: Не удалось считать штрих-код

# deleteAccount
source: Incorrect password
ru: Неверный пароль

# editUser
source: Failed to edit user details
ru: Не удалось отредактировать данные пользователя

source: Error
ru: Ошибка

# getUser
source: Failed to get user data
ru: Не удалось получить данные пользователя

# locationError
source: Can't get location
ru: Не удается получить геолокацию

# locationSettingError
source: Open access to geolocation in your device settings
ru: Откройте доступ к геолокации в настройках устройства

# networkError
source: Check your internet connection
ru: Проверьте подключение к интернету

# parsingError
source: Problem processing data
ru: Проблема при обработке данных

# registrationError
source: Registration error. Enter a correct email or a more complex password.
ru: Ошибка регистрации. Введите корректный email или более сложный пароль.
